let arrResults = [ 
{"col1":0, "col2":0, "result":"" }, // empty record
{"col1":1, "col2":1, "result":"<P>Земля погано пристосована для спостереження за зірками. Щільна атмосфера поглинає майже весь спектр, а те, що не поглинає - спотворює. Потужна сила тяжіння утруднює виготовлення великих телескопів. Радіоперешкоди заважають радіотелескопам. Єдиний вихід - виносити обладнання за межі Землі, і з цим НАСА може допомогти. Перший автоматичний орбітальний телескоп <A HREF='https:\/\/en.wikipedia.org\/wiki\/Orbiting_Astronomical_Observatory_2' TARGET='_blank' було запущено у 1968 році. Найбільш відомий серед космічний телескопів, безумовно, <A HREF='http:\/\/en.wikipedia.org\/wiki\/Hubble_Space_Telescope' TARGET='_blank'>Hubble</A>, теж створений під егідою НАСА, відкрив нові глибини космосу, недоступні з Землі. Зараз на навколоземній та інших орбітах вже працює чимало космічних телескопів, зокрема, <A HREF='https:\/\/en.wikipedia.org\/wiki\/Wide-Field_Infrared_Survey_Explorer' TARGET='_blank'>WISE</A>, відомий тим, що після виходу на пенсію він перекваліфікувався у мисливця на астероїди, або <A HREF='https:\/\/en.wikipedia.org\/wiki\/Herschel_Space_Observatory' TARGET='_blank'>Hershel</A>, створений НАСА спільно з ЄКА. Незабаром до них може приєднатися <A HREF='' TARGET='_blank'>Webb</A>." }, // astronomy & orbit
{"col1":1, "col2":2, "result":"<P>Густа атмосфера Землі схожа на товсту стіну, в якій є два маленькі віконечка. Перше віконечко, пропускає видиме світло, друге - крихітну смужку радіовипромінювання з довжиною хвиль від 1 мм до 30 м. Решта електромагнітного випромінювання в атмосфері швидко згасає. <P>Між тим, ультрафіолет, гамма-випромінювання та інші частини спектру несуть багато інформації про Всесвіт. Тому вакуум - друг астронома. Оптичний телескоп <A HREF='https:\/\/hubblesite.org\/' TARGET='_blank'>Hubble</A> <A HREF='https:\/\/www.space.com\/hubble-space-telescope-pds-70b-exoplanet#:~:text=While%20Hubble%20has%20spotted%20over,so%20far%20away%20and%20small.' TARGET='_blank'>виявив більше 4000 екзопланет</A> - планет, розташованих в інших зоряних системах і зробив багато інших відкриттів.<P>Гамма- та ультрафіолетові телескопи можуть працювати лише у космічному вакуумі. На щастя, з вакуумом НАСА може допомогти." },
{"col1":1, "col2":3, "result":"<P>Уявіть собі, що дивитесь у кінотеатрі фільм крізь малесенький отвір діаметрів пару міліметрів. Картина абсурдна, але саме так, на жаль, ми дивимося на Всесвіт. Спостереження в гамма-діапазоні дозволяють побачити те, що не видно в інших діапазонах. Це дуже важливо, і не лише для розширення наших знань про Всесвіт. Спалахи потужного гамма-випромінювання можуть знищити життя на Землі, тому вкрай важливо знайте джерела потужного гамма-випромінювання й навчитися передбачати ці спалахи. Докладніше з гамма-астрономією можна ознайомитися <A HREF='https:\/\/en.wikipedia.org\/wiki\/X-ray_astronomy' TARGET='_blank'>тут</BR>." }, 
{"col1":1, "col2":4, "result":"<P>Найбільший наземний оптичний телескоп <A HREF='https:\/\/en.wikipedia.org\/wiki\/Gran_Telescopio_Canarias' TARGET='_blank'>GTS</A> має діаметр 10.4 м. Щоб утримувати та маніпулювати цим велетнем, знадобилася велична споруда з могутніми електромоторами. Знаменитий радіотелескоп <A HREF='https:\/\/en.wikipedia.org\/wiki\/Arecibo_Observatory' TARGET='_blank'>Аресибо</A> мав діаметр 468 метрів, і був нерухомим. Найбільший в світі телескоп в діапазоні дециметрових хвиль <A HREF='https:\/\/en.wikipedia.org\/wiki\/Ukrainian_T-shaped_Radio_telescope,_second_modification' TARGET='_blank'>УТР-2</A> має розміри 1800х900м. Він теж нерухомий. Невагомість дасть можливість побудувати телескопи,що будуть в рази, в десятки та сотні разів більшими.<P>Увесь Всесвіт буде як на долоні." },
{"col1":1, "col2":5, "result":"<P>Інфрачервоне випромінювання це, по суті, тепло. Щоб краще його вловлювати, детектор треба охолодити. Чим дужче охолоджений детектор, тим він чутливіший. Для охолодження використовують зріджені гази азот, водень і гелій, але кожен градус холоду даєтся важко. Якщо космічний апарат розташувати на такій орбіті, щоб Земля затуляла його від Сонця, він сам собою охолодиться до низьких температур. Для деяких вимірювань цього достатньо, а якщо знадобиться ще глибша заморозка, то охлодити детектор на 20-40 градусів легше й дешевше. наж на 200. Саме тому космос - ідеальне середовище для ІЧ-телескопів, найуспішніший з яких, <A HREF='https:\/\/en.wikipedia.org\/wiki\/Spitzer_Space_Telescope' TARGET='_blank'>Spitzer</A>, працював на орбіті сімнадцять років й зробив немало відкриттів." }, 
{"col1":1, "col2":6, "result":"<P>Телескопи люблять спокій. Будь-які вібрації, навіть найменші, вносять перешкоди у спостереження. А люди, на жаль, без вібрацій не можуть. Вони ходять, дихають, перекладають предмети з місця на місце, грюкають дверима і чхають. Тому ідеальна обсерваторія - безлюдна, повністю автоматизована обсерваторія, і чим довше вона безлюдна, тим краще для спостережень. На Землі не так уже й багато місць де нема людей, а космос поки що заселений негусто. Тому майбутнє, очевидно, за космічними, повністю автоматичними обсерваторіями. Скоріш за все, їхній робочий час буде продаватися, як продається зараз робочий час деяких обсерваторій, але цілком імовірно, що для певні години будуть видаватися й безкоштовно, як, наприклад, їх <A HREF='https:\/\/www.telescope.org' TARGET='_blank'>видає</A> телескоп PIRAT на Тенерифі." }, 
{"col1":2, "col2":7, "result":"<P>" }, 

{"col1":2, "col2":1, "result":"<P>Умови космосу унікальні. На Землі важко створити комбінацію таких чинників, як вакуум, перепади температур, потік сонячної та галактичної радіації, холод. Невагомість можна створити лише на короткий час, буквально на кілька секунд. Тому для вивчення нових матеріалів доводиться піднімати їх на орбіту, встановлювати на зовнішій поверхні МКС або навіть запускати окремі космічні апарати з зразками матеріалів. Такі експерименти ведуться практично з перших кроків у космосі. Докладніше про них можна почитати на <A HREF='https:\/\/www.nasa.gov/centers/langley/news/factsheets/MISSE.html'>сторінці</A> НАСА." }, 
{"col1":2, "col2":2, "result":"<P>Для створення вакууму в земних умовах потрібна складна й дорога апаратура. Для створення глибокого вакууму самих лише насосів недостатньо, в хід ідуть інші методи - термічні, електромагнітні, хімічні. У вакуумні камери просочується повітря, випаровуються гази, розчинені в матеріалі камери, і навіть сам матеріал камери, тому земний вакуум нестійкий і вимагає безперервної роботи з його підтримання.<P>Космічний вакуум стабільний, безкінечний у часі та просторі, тому ідеально підходить для виробництва надчистих матеріалів, експериментів по вивченню тривалої дії вауума на матеріали і т.п. У вакуумі добре працюють методи, малонепридатні для використання в атмосфері, наприклад, електронна різка, зварювання, напилення. Тому, як не дивно, але космічний вакуум інколи виявляється дешевшим за земний, а інколи нема іншої ради окрім використання космічного вакууму. " }, 
{"col1":2, "col2":3, "result":"<P>Здавалося б, нема сенсу везти зразок на орбіту для вивчення впливу радіації, опромінити зразок простіше в ядерному реакторів. <P>Але ні. Реактори та інші наземні джерела видають переважно гамма та нейтронне випромінювання. У космосі частка гамма-випромінювання незначна, нейтронів теж небагато. Натомість є протони, альфа-частки та ядра атомів інших елементів, які до того ж рухаються з великими швидкостями, які важко або й неможливо отримати в земних умовах.<P>Тому на борту МКС регулярно проводяться експерименти по вивченню впливу радіації на матеріали та стійкості матеріалів в умовах космічної радіації. Докладніше про ці експерименти можна почитати на <A HREF='https:\/\/www.nasa.gov/centers/langley/news/factsheets/MISSE.html'>сторінці</A> НАСА. " }, 
{"col1":2, "col2":4, "result":"<P>Мідь важка, алюміній легкий. Сплав з міді та алюмінію міг би поєднати високу електропровідність міді та низьку собівартість алюмінію, але якщо ці матеріали змішати, мідь опиниться внизу, алюміній зверху. У невагомості важкі та легкі метали змішуються рівномірніше, що відкриває шлях до сплавів, які в земних умовах отримати неможливо. Також сила тяжіння заважає росту кристалів, тому надчисті кристали легше виростити у невагомості. Так,  " }, 
{"col1":2, "col2":5, "result":"<P>Під впливом екстремального холоду багато матеріалів міняють свої властивості. Оливо перетворюється на сірий порошок. Свинець твердішає. Органічні матеріали та пластики починають кришитися та розсипатися. Але отримувати й довгий час підтримувати глибокий холод досить дорого, тому інколи для випробувань нових матеріалів дешевше розмістити їх в космосі. Тому НАСА <A HREF='https:\/\/www.nasa.gov\/press-release\/nasa-opens-international-space-station-to-new-commercial-opportunities-private' TARGET='_blank'>відкрило</A> МКС для приватних експериментів, у тому числі й щодо розміщення зразків в космосі. " }, 
{"col1":2, "col2":6, "result":"<P>Є ціла група матеріалів, які вимагають тривалої ізоляції, і це дуже важливі матеріало - радіоактивні відходи. Сучасними технологіями знищити їх або переробити у щось корисне неможливо або надзвичайно дорого, тому доводиться будувати спеціальні сховища і просто зберігати відходи у них. Це теж дуже дорого. Сховища розраховані на сотні або й тисячі років. Інколи їх вирубають у скелях, інколи будують в місцях, де малоймовірні землетруси, виверження вулканів, повені, інші стихійні лиха. На жаль, жодне сховище не застраховане від удару метеорита або проникненння терористів.Тому відправка радіоактивних відходів у глибокий космос видається дуже перспективним шляхом позбавлення радіоактивних відходів. На орбіті вони будуть недоступні для терористів, невразливі до земних катастроф, а у разі вкрай малоймовірного зіткнення з метеоритом не загрожуватимуть людству. Якщо ж відправлені в космос матеріали знадобляться знову, по них може бути відправлений космічний корабель." }, 
{"col1":2, "col2":7, "result":"<P>На поточний момент у нас немає ідей, як використати високі швидкості космічних апаратів для матеріалознавства. Можливо, у вас є?" }, 
// medicine & microgravity - Данные по смертности участников лунных полётов показывают повышенный процент смертей от сердечно-сосудистых заболеваний, по сравнению с околоземными астронавтами. Но пока для далеко идущих выводов слишком малая выборка (семь случаев), и рано говорить о прямой угрозе межпланетной среды. эксперименты на мышах также показали, что сочетание имитации невесомости и облучения тяжелыми заряженными частицами способно нанести вред сердечно-сосудистой системе.
// ботаніка
{"col1":3, "col2":1, "result":"<P><A HREF='https:\/\/en.wikipedia.org\/wiki\/Plants_in_space' TARGET='_blank'>Експерименти</A> з рослинами в космосі почалися ще до початку космічної ери, у 1946 році. Насіння літало навколо Місяця у 1970. На орбітальних станціях <A HREF='#' TARGET='_blank'>Скайлеб</A> насіння пророщували, а на <A HREF='#' TARGET='_blank'>МКС</A> вирощений у мікрооранжереях салат навіть вживають у їжу. Вплив невагомісті, радіації, ізольованої атмосфери, добового ритму та інших факторів на рослини вивчається, й інколи результати дивують. Так, наприклад, горох при зростанні у невагомості закручує листя по спіралі й замість гравітації орієнтується на джерело світла. Інші ж рослини виявили високу чутливість навіть до найменшої сили тяжіння. А довжина волокон космічної бавовни майже виявилась майже вдвічі довшою за найдовші (і найдорожчі) земні сорти. Тепер космічну бавовну вирощують в Узбекистані. Деяким рослинам в космосі, схоже, подобаєтся - так, наприклад, женьшень збільшив біологічну активність в кілька разів.<P>Схоже, що агрохолдингам варто дуже ретельно розглянути можливість співпраці з НАСА." }, 
{"col1":3, "col2":2, "result":"<P>На поточний момент у нас немає ідей, як поєднати ботаніку та космічний вакуум. Можливо, у вас є?" }, 
{"col1":3, "col2":3, "result":"<P>Радіація - дуже потужний мутагенний фактор. Гамма-випромінювання та важкі частки пошкоджують ДНК рослин та істот, викликають дивні мутацїї. На щастя, Земля прикрита від потоків космічної радіації щитом атмосфери, тож більша частина ударів до нас не долинає. Але частина все-таки проникає в атмосферу й шкодить. Тому дослідження рослин на орбіті, де потік радіації значно вищий, може дати цінний матеріал про напрямки мутацій, що виникають під впливом космічної радіації, про можливу роль радіаціґ у виникненні ракових пухлин, про способи зменшення ризику виникнення пухлин або променевої хвороби та про лікування їх. Тому на орбіті майже весь час працюють невеликі оранжереї з рослинами. Наприклад, зараз на борту МКС __" }, 
{"col1":3, "col2":4, "result":"<P>Перші <A HREF='https:\/\/en.wikipedia.org\/wiki\/Plants_in_space' TARGET='_blank'>експерименти</A> з рослинами почалися задовго до орбітальних польотів. Насіння кукурудзи літало в космос на ракетах Фау-2 у 1946 році. Перша рослина виросла у невагомості у 1982 році. Результати експериментів показують, що рослини вловлюють дуже низький рівень гравітації й ростуть з урахуванням її напрямку. Деякі рослини демонструють прискорене зростання. Ці експерименти мають не лише наукове значення. Космонавт на МКС вже їдять салат та інші культури, вирощені в космосі. <P>Коли-небудь на орбіті з'являться величезні оранжереї, і можливо, не Земля годуватиме мешканців космосу, а навпаки. " }, 
{"col1":3, "col2":5, "result":"<P>Рослини бояться холоду й не можуть рости при температурі менше 0 градусів Цельсія. Але це не значить, що глибокий холод не може допомогти ботанікам. Холод консервує. Взяті з рослин зразки та насіння можуть зберігатися значно довше, аніж при кімнатній температурі. На Землі низьку температуру доводиться підтримувати за допомогою складних машин та невпинної витрати енергії. В космосі холод безкоштовний. Тому цілком імоввірно, що коли-небудь на високі орбіти буде запущено один або кілька супутників з насінням або кореневищами рослин. А у разі якщо рослинний світ Землі постраждає від глобаьної катастрофи - удару астероїда або ядерної війни, принаймні частина рослинного світу зможе бути відновленя з космічного банку. Такі сховища вже <A HREF='https:\/\/en.wikipedia.org\/wiki\/Svalbard_Global_Seed_Vault' TARGET='_blank'>є на Землі</A>, але це якраз той випадок, коли краще розкласти яйця по якнайбільшій кількості кошиків." }, 
{"col1":3, "col2":6, "result":"<P>На острові Шпіцберген побудоване найбільше в світі <A HREF='https:\/\/en.wikipedia.org\/wiki\/Svalbard_Global_Seed_Vault' TARGET='_blank'>сховище для насіння. Зроблено це на випадок ядерної війни, удару астероїда або іншої глобальної катастрофи. Проектанти сховища сподіваються, що у разі, якщо рослинний світ Землі постраждає, сховище допоможе його відновити. На жаль, якщо удар прийдеться по самому сховищу, то насіння загине. Додатковою гарантією збереження насіння можуть стати космічні сховища. Запущені на високі орбіти капсули з насінням можуть збергіатися вічно і являти собою непоганий бекап на випадок глобальної катастрофи. На поточний момент відомостей про розробку такого проекту нема, але вже проводяться <A HREF='https:\/\/www.techtimes.com\/articles\/208023\/20170524\/doomsday-vault-in-space-baby-mice-born-on-earth-with-sperm-stored-on-iss.htm' TARGET='_blank'>експерименти</A> з тривалим збереженням у космосі інших біологічних матеріалів." }, 
{"col1":3, "col2":7, "result":"<P>Рослини вигадали чудовий спосіб самоконсервації та передачі генів у майбутнє - насіння. Воно може зберігатися десятки й сотні років. Так, есперимент з тривалого зберігання насіння стартував у __ й насіння все ще зберегло здатність проростати. Але тисячі або десятки тисяч років таки погасять іскру життя навіть у найвитриваліших зернятках. Та й живі рослини таким не зберегти. Що ж може зберегти, законсервувати на сотні тисяч або й мільйони років? Відповідь є у НАСА - висока швидкість. В космічному апараті, швидкість якого наближчається до швидкості світла, час уповільнюється. На Землі може пройти мільйон років, а на космічному кораблі - лише рік. Тож ідеальна капсула часу - космічний корабель, що рухаєтьсяз швидкістю 299 000 кілометрів на секунду. Поки що такі швидкості нам недоступні, але є надія, що рано чи пізно ми таки наздоженемо світло. І дослідниця з далекого майбутнього буде вдячна далекому предку за подарунок - квітку з часів, коли люди ще тільки починали довгий шлях до зірок." }, 
// microbiology
{"col1":4, "col2":1, "result":"<P>41" },
{"col1":4, "col2":2, "result":"<P>42 Вакуум" }, 
{"col1":4, "col2":3, "result":"<P>Радіація" }, 
{"col1":4, "col2":4, "result":"<P>Бактерії - одні з небагатьох живих істот, яким подобається невагомість. Вони непогано себе почувають на кордоні двох середовищ наприклад, повернхі води або людскій шкірі. Рідина в невагомості утворює кулі або розтікається по стінкам посудини, так що з поверхнями все гаразд. Тяжіння бактеріям непотрібне.  " }, 
{"col1":4, "col2":5, "result":"<P>Холод " }, 
{"col1":4, "col2":6, "result":"<P>Експерименти з деякими бактеріями небезпечні. Мікробіологічні лабораторії намагаються розміщати в безлюдних місцях з неприятливими для життя кліматичними умовами, але це не рятує. Так, у 1979 в місті Свердловськ <A HREF='https:\/\/uk.wikipedia.org\/wiki\/%D0%95%D0%BF%D1%96%D0%B4%D0%B5%D0%BC%D1%96%D1%8F_%D1%81%D0%B8%D0%B1%D1%96%D1%80%D0%BA%D0%B8_%D0%B2_%D0%84%D0%BA%D0%B0%D1%82%D0%B5%D1%80%D0%B8%D0%BD%D0%B1%D1%83%D1%80%D0%B7%D1%96' TARGET='_blank'>спалахнула</A> епідемія сибірки, яка з високою ймовірністю була викликана витоком з військово-бактеріологічної лабораторії. Загинуло не менше 100 осіб.<P>Тому Супутник-біологічна лабораторія, розташований на високій орбіті, є ідеальним варіантом для потенційно небезпечних експериментів. Крім того, космічні умови, зокрема радіація, яка пришвидшує мутації, може стати в пригоді для тривалих еволюційних експериментів." }, 
{"col1":4, "col2":7, "result":"<P>Бактерії непогано консервуються за допомогою холоду, але не всі й не надовго. Для справді тривалої консервації можливо використати релятівістський ефект уповільнення часу при досягненні субсвітлових швидкостей. Якщо капсулу з зразками бактерій розігнатися до швидкості, що лише трохи поступається швидкості світла, час в капсулі практично зупиниться, і бактерії зберігатимуться незмінними протягом сотень, тисяч і навіть мільйонів років. Поки що такі швидкості нам недоступні, але коли-небудь фотонні зорельоти та капсули часу таки вирушать в космос." },
// virusology
{"col1":5, "col2":1, "result":"<P>51" },
{"col1":5, "col2":2, "result":"<P>52" }, 
{"col1":5, "col2":3, "result":"<P>53" }, 
{"col1":5, "col2":4, "result":"<P>54" }, 
{"col1":5, "col2":5, "result":"<P>55" },
{"col1":5, "col2":6, "result":"<P>Експеримент з вірусом, проведений любителем екзотичної їжі в Китаї у 2019 році, показав, що деякі експерименти краще не проводити. Або ж проводити їх в умовах, коли піддослідні об'єкти не вирвуться з-під контролю. А якщо вирвуться. то негайно загинуть. А якщо не загинуть, то не матимуть жодних контактів з людьми. Єдине місце, що відповідає усім названим критеріям - космос. Цілком імовірно, що коли-небудь всі небезпечні експерименти з вірусами будуть проводитися виключно на високих орбітах, на Місяці або на астероїдах." },
{"col1":5, "col2":7, "result":"<P>Віруси важко зберігати. __. Для справді тривалої консервації можливо використати релятівістський ефект уповільнення часу при досягненні субсвітлових швидкостей. Якщо капсулу з зразками бактерій розігнатися до швидкості, що лише трохи поступається швидкості світла, час в капсулі практично зупиниться, і бактерії зберігатимуться незмінними протягом сотень, тисяч і навіть мільйонів років. Поки що такі швидкості нам недоступні, але коли-небудь фотонні зорельоти та капсули часу таки вирушать в космос." },
// energy
{"col1":6, "col2":1, "result":"<P>Перше, що спадає на думку при згадці комбінації орбіта-енергія - це, звичайно, винесені на орбіту сонячні електростанції. Таке рішення має цілий ряд переваг - сонячні батареї отримують потужне, не пригашене атмосферою світло, і водночас не займають немалі площі на Землі. Передавати енергію вниз можна за доомогою мікрохвильового випромінювання. Але можна й не передавати, споживачі знайдуться і на орбіті. В першу чергу це брудні виробництва, але є й цікавіші проекти - міжзоряні кораблі з <A HREF='__' TARGET='_blank'>зовнішніми</A> джерелами енергії. Детальніше з проектами орбітальних електростанцій можна ознайомитися, наприклад, <A HREF='__' TARGET='_blank'>тут</A>." },
{"col1":6, "col2":2, "result":"<P>!Як не дивно, але вакуум непоганий провідник. Електрони вільно летять у вакуумі, бо їх ніщо негальмує, а способи вирвати їх з цупких обіймів атомів давно відомі - див., наприклад, <A HREF='https:\/\/en.wikipedia.org/wiki\/Electron_gun' TARGET='_blank'>електронна гармата. Чи може вона стріляти через десятки кілометрів вакуума? Цілком. <BR>Мікрохвильове випромінювання, за дпомогою якого теж можна передавати енергію, наприклад, з орбітальної електростанції на міжпланетний або міжхоряний корабель, також любить вакуум, менше розсіюється й не поглинається. <BR>Комбінація енергетики та вакуума відкриває шляхи до нових способів передачі, а в перспективі - до міжпланетних та міжзоряних подорожей. " }, 
{"col1":6, "col2":3, "result":"<P>!Радіація - це енергія. Це чиста енергія, яка знаходиться скрізь, просто на поверхні Землі її менше, бо атмосфера. Якщо навчитися її вловлювати та кнцентрувати, всі проблеми з енегрією будуть вирішені назавжди." }, 
{"col1":6, "col2":4, "result":"<P>!Сонячна електростанція - це великі, великі, великі панелі, весь час скеровані на Сонце. Чим більші панелі - тим важче їх повертати; тим більше місця вони займають на поверхні Землі, тим масивніша їхня конструкція. <BR>Невагомість різко знижує вимоги до сонячних панелей. Невагомі панелі <A HREF='https:\/\/en.wikipedia.org\/wiki\/Space-based_solar_powe' TARGET='_blank'>космічних сонячних електростанцій</A> можуть мати величезні розміри, і міняти їхню орієнтацію теж простіше." }, 
{"col1":6, "col2":5, "result":"<P>!Холод - це шлях до надпровідників, напровідники це шлях до різкого зменшення втрат енергії, а зменшення втрат енергії - це буквально перехід енергетики на новий рівень. Скоріш заз все, космічні електростанції будуть використовувати надпровідники. Вдало підібравши орбіту, так щоб тепловий баланс провідників був нижче точки переходу, можна отримати, точніше, не втратити, дуже багато енергії.<BR>Крім того, чим менше втрат енергії, тим менше виділяється тепла, а це також важливо." },
{"col1":6, "col2":6, "result":"<P>!Електростанція - небезпечне місце. <BR>Висока напруга, багато вразливих місць, неізольовані дроти - все це робить небажаними візити електростанцію сторонніх людей або тварин. Відомі аварії, що виникли внаслідок проникнення тварин на електростанцію. <BR>Аварії на електростанціях призводять до тяжких наслідків, інколи до тривалого забруднення середовища шкідливими речовинами.<BR>Якщо ж винести електростанції в космічний простір, то навіть найтяжча аварія не призведе до тяжких наслідків." },
{"col1":6, "col2":7, "result":"<P>!Ми поки що не знаємо, як саме використати релятівістські ефекти в енергетиці, але цілком імовірно, що це поєднання має великі перспективи. <BR>Можливо, вам якраз і випаде вивчити цю проблему й побудувати першу космічну релятивістську електростанцію?" },
// particle physic 
{"col1":7, "col2":1, "result":"<P>71" },
{"col1":7, "col2":2, "result":"<P>72" }, 
{"col1":7, "col2":3, "result":"<P>73" }, 
{"col1":7, "col2":4, "result":"<P>74" }, 
{"col1":7, "col2":5, "result":"<P>75" },
{"col1":7, "col2":6, "result":"<P>76" },
{"col1":7, "col2":7, "result":"<P>77" },
// geophisic
{"col1":8, "col2":1, "result":"<P>81" },
{"col1":8, "col2":2, "result":"<P>82" }, 
{"col1":8, "col2":3, "result":"<P>83" }, 
{"col1":8, "col2":4, "result":"<P>84" }, 
{"col1":8, "col2":5, "result":"<P>85" },
{"col1":8, "col2":6, "result":"<P>86" },
{"col1":8, "col2":7, "result":"<P>87" },
// meteo
{"col1":9, "col2":1, "result":"<P>До початку космічних польотів метеорологія була недонаукою, на кшталт алхімії. Ніякі мережі наземних датчиків не могли передбачити тайфун або зпрогнозувати його маршрут. Лише завдяки супутникам метеорологія стала точною наукою (ну, майже). Кожного разу, зазираючи на сайт погоди або слухаючи прогноз по радіо, ви маєте дякувати супутникам дистанційного зондування Землі.<BR>За деякими оцінками, метеосупутники щорічно рятують від голоду 50-60 мільйонів людей." },
{"col1":9, "col2":2, "result":"<P>Вакуум - хороше середовище для лазерів та мазерів. Він не поглинає світло або мікрохвильове випромінювання. <BR>- Це добре, - скажете ви. - Але до чого тут метеорологія?<BR>А ось до чого. В романі Кларка &quote;Фонтани раю&quote; згадуються погодні супутники - але це не сучасні метеосупутники, що збирають інформацію про стан атмосфери. Супутники Кларка оснащені потужними інфрачервоними лазерами, які використовують щоб розігнати хмари на певних ділянках й таким чином регулювати вітри, дощі, інші погодні явища, включаючи смерчі та урагани. " }, 
{"col1":9, "col2":3, "result":"<P>Уважне спостереження за Сонцем дозволяє передбачати спалахи. Спалахи небезпечні, вони несуть пряму загрозу астронавтам, що знаходяться на орбіті, а також техніці та людям на поверхні Землі. Потужні сонячні спалахи виводять з ладу лінії електромереж та зв'язку, і навіть збільшують ризик серцевих нападів. Таким чином, передбачення або хоча б раннє виявлення спалахів життєво важливе. Тому зараз на різних орбітах - і навколземних, і навколосонячних - крутяться кілька космічних апаратів, що невпинно моніторять стан Сонця. У одного з космічних апаратів, що цим займається, є власна <A HREF='https:\/\/sdo.gsfc.nasa.gov' TARGET='_blank'>сторінка</A>." },
{"col1":9, "col2":4, "result":"<P>Метео- означає повітря. Більшість погодних явищ зумовлені станом атмосфери, зокрема, вихорам в ній. Вивчення законів формування вихорів може багато чого сказати про поведінку вихорів, а отже, покращити прогнози погоди.<BR>Між тим гравітація вносить свої поправки в рух вихора. Було б цікаво провести серію досліджень вихорів в умовах мікрогравітації. Наскільки відомо авторам цього тексту, такого досліду ще ніхто ніде не робив. <BR> Може, ви зробите?" }, 
{"col1":9, "col2":5, "result":"<P>Інфрачервоне випромінювання може сказати про атмосферу набагато більше, ніж видима частина спектру. По суті, це пряме вимірювання температури повітря або поверхні за допомогою ІЧ-датчиків. Чим краще они охолоджені, тим чутливіші.Для охолодження використовують зріджені гази азот, водень і гелій, але кожен градус холоду даєтся важко. Якщо космічний апарат розташувати на такій орбіті, щоб Земля затуляла його від Сонця, він сам собою охолодиться до низьких температур. Для деяких вимірювань цього достатньо, а якщо знадобиться ще глибша заморозка, то охлодити детектор на 20-40 градусів легше й дешевше. наж на 200. Саме тому космос - ідеальне середовище для датчиків, що працюють в ІЧ-діапазоні" },
{"col1":9, "col2":6, "result":"<P>Автори цього тексту не придумали, як можна зв'язати тривалу ізоляцію та метеорологію.<BR>Спробуйте придумати ви." },
{"col1":9, "col2":7, "result":"<P>Висока швидкість, з якою метеосупутник летить над Землею, означає, що за короткий час він може оглянути значну площу. <BR>Чим більша площа - тим більше даних, чим більше даних - тим точніший прогноз погоди." },
// food production
{"col1":10, "col2":1, "result":"<P>А чому б нам не винести ферми та плантації в космос?<BR>Вільного місця на Землі все менше й менше, наземне сільське господарство важко піддається автоматизації, корови виділяють парникові гази, рослини не хочуть рости взимку.<BR>Між тим космічна оранжерея могла б надати рослинам ідеальні умови для зростання; гідропонне живлення рослин дає можливість повністю уникнути оранки, боронування, прополки та інших важких і брудних операцій. Можливо, колись ми зможемо вирощувати і м'ясо - і знову ж таки, це краще робити в космосі.<BR>А на Землі ми лишимо тільки великі сади." },
{"col1":10, "col2":2, "result":"<P>Вакуумування - непоганий спосіб консервації, а необхідність консервації їжі не викликає сумнівів. Кожна велика країна має так звані стратегічні резерви - запаси їжі на випадок серії неврожаїв, масштабнох катастрофи, великої війни. Але сховища для їжі вразливі, особливо у випадку війни. Зазвичай в них підтримується оптимальна температура, вологість, інколи газовий склад; сховищам необхідна охорона та обслуговуваня. Все це вимагає витрат.<BR>У той же час виведені на високу орбіту запас можуть зберігатися тисячі або й десятки тисяч років.<BR>На сьогоднішній день організувати стратегічні резерви на орбіті неможливО, але цілком імовірно, що з часом, коли вартість виводу на орбіту вантажів сильно впаде, людство покладе в космічний холодильник запас м&quote;яса, овочів, фруктів і котячого корму, бо як же без котиків." }, 
{"col1":10, "col2":3, "result":"<P>Ми точно не знаємо, як поєднати космічну радіацію та виробництво їжі. Можливо, радіацію можна використати для стерилізації? Або вловлювати й використовувати як джерело енергії для космічних оранжерей? АБо навпаки, упаковками їжі вдасться екранувати екіпаж під час подорожі до Марсу?<BR>Або ви щось придумаєте?" }, 
{"col1":10, "col2":4, "result":"<P>Штучне м'ясо краще краще вирощувати у невагомості, бо йому не потрібен скелет.<BR>Звучить фантатично? Так.Але розробки в цьому напрямку вже ведуться, і якщо на Землі дослідники мають обмеження, зумовлені силою тяжіння, то в космосі цих обмежень нема. Штучний ескалоп, виготовлений у космосі, може бути будь-якого розміру." }, 
{"col1":10, "col2":5, "result":"<P>Якщо коли-небудь ми нам знадобиться величезний холодильник - наприклад, для зберігання запасів їжі на випадок неврожаю, катастрофи чи війни - то він поруч. Це космос. <BR>Вдало підібравши орбіту, так щоб на борту корабля-холодильника зберігалася оптимальна температура, можна розмістити практично необмежені запаси. Вони можуть зберігатися сотні й тисячі років. А ще їх не вкрадуть, не продадуть без відома власника." },
{"col1":10, "col2":6, "result":"<P>Кожна велика країна має так звані стратегічні резерви - запаси їжі на випадок серії неврожаїв, масштабної катастрофи, великої війни. Але сховища для їжі вразливі, особливо у випадку війни. Зазвичай в них підтримується оптимальна температура, вологість, інколи газовий склад; сховизам необхідна охорона та обслуговуваня. Все це вимагає витрат.<BR>У той же час виведені на високу орбіту запас можуть зберігатися тисячі або й десятки тисяч років.<BR>На сьогоднішній день організувати стратегічні резерви на орбіті неможливО, але цілком імовірно, що з часом, коли вартість виводу на орбіту вантажів сильно впаде, людство покладе в космічний холодильник запас їжі." },
{"col1":10, "col2":7, "result":"<P>Інколи люди опиняються перед необхідністю термінової доставки вантажів. Настільки термінової, що мова йде про години - наприклад у разі землетрусу або масштабної катастрофи. Якщо таке стається у віддалених районах, люди залишаються без всього, в тому числі без їжі. Доставка літаком може бути неможливою - наприклад, через метеоумови або відсутність аеродромів. Швидкісні ракетні системи доставки термінових вантажів могли б тут зарадити. " },
// culture
{"col1":10, "col2":1, "result":"<P>Культурні здобутки в космосі? Чому б і ні. Практика показала, що людина бере з собою культуру завжди, навіть у найнебезпечніші подорожі та на війну. Відкривши Гренландію та Америку, вікінги склали про неї римовані саги. Хрестоносці тягали з собою трубадурів та мейнезінгерів. Солдати Другої Світової у перервах між боями грали на губних гармоніках та читали вірші. Астронавти на орбіті читають художні твори, дивляться фільми, слухають музику. Кілька астронавтів самі написали по книжці, деякі й не по одній." },
{"col1":10, "col2":2, "result":"<P>Атмосфера руйнує. Реакції окислення змінює барви картин, а мікроорганізми буквально з'їдають верхній шар будь-якого предмету.<BR>Можливо, в майбутньому, коли з'являться недорогі способи виведення вантажів на орбіти, деякі предмети мистецтва будуть зберігатися не в герметичних сховищах на Землі, а в космосі. Милуватися ними буде складно, але щодо деяких творів це, можливо, на краще." }, 
{"col1":10, "col2":3, "result":"<P>Гадаю, мало який художник відмовився б намалювати картину розміром в десятки або й сотні кілометрів, причому такими фарбами, що світяться й переливаються. Мова йде про полярне сяйво, яке виникає внаслідок гальмування високоенергетичних заряджених частинок в атмосфері. Експерименти з створення штучного полярного сяйва вже <A HREF='https:\/\/www.frontiersin.org\/articles\/10.3389\/fspas.2019.00014\/full' TARGET='_blank'>проводилися</A>, але намалювати картину в небі ще ніхто не пробував. <BR>Може, ви спробуєте?" }, 
{"col1":10, "col2":4, "result":"<P>Невагомість - рай для скульпторів, просто вони про це ще не знають.<BR>Уявляєте, які химерні форми можна створити, якщо немає обмежень" }, 
{"col1":10, "col2":5, "result":"<P>Холод непоганий консервант. Можливо, коли-небудь предмети мистецтва будуть зберігатися в космічних умовах." },
{"col1":10, "col2":6, "result":"<P>106" },
{"col1":10, "col2":7, "result":"<P>107" }
];

//-- global variables
var
  speed1 = 1;
  speed2 = 1;
  speed3 = 1;
  maxSpeed1 = 8;
  maxSpeed2 = 12;
  maxSpeed3 = 18;
  pos1 = 0;
  pos2 = 0;
  pos3 = 0;
  isClick="";
  memberResult={"col1":0, "col2":0, result:""};

function init() {
  result = document.getElementById("result");
  stResult = result.innerHTML;
  memberResult = arrResults[1];
};

function moveTables() {
  nRowHeight=tab1.rows[0].clientHeight;
  speed1 = speed1+1;
  speed2 = speed2+1;
  speed3 = speed3+1;
  pos1 = pos1 - speed1;
  pos2 = pos2 - speed2;
  pos3 = pos3 - speed3;
  tab1.style.marginTop = pos1+"px";
  tab2.style.marginTop = pos2+"px";
  tab3.style.marginTop = pos3+"px";
  if (speed1 > maxSpeed1) { speed1 = maxSpeed1; };
  if (speed2 > maxSpeed2) { speed2 = maxSpeed2; };
  if (speed3 > maxSpeed3) { speed3 = maxSpeed3; };

  if (speed1 >= maxSpeed1 && speed2 >= maxSpeed2 && speed3 >= maxSpeed3) {
//  if (-1*pos1 > nRowHeight*(tab1.rows.length-1) ) {
       btn.disabled =false;
  };

  if (pos1 <= -1 * tab1.rows.length*nRowHeight + nRowHeight) { pos1 = -1*nRowHeight; };
  if (pos2 <= -1 * tab2.rows.length*nRowHeight + nRowHeight) { pos2 = -1*nRowHeight; };
  if (pos3 <= -1 * tab3.rows.length*nRowHeight + nRowHeight) { pos3 = -1*nRowHeight; };
}

function btnOnClick() {
   isClick="yes";
   result = document.getElementById("result");

   btn = document.getElementById("control");
   tab1 = document.getElementById("tab1");
   tab2 = document.getElementById("tab2");
   tab3 = document.getElementById("tab3");

   if (btn.innerHTML == "Start" && isClick == "yes") {
       isClick = "";
       result.innerHTML = "";
       btn.innerHTML = "Stop";
       btn.setAttribute("disabled", true);
       t = setInterval(function(){ moveTables() }, 50);
   }; //-- if btn == "Start"

   if (btn.innerHTML == "Stop" && isClick == "yes") {
       isClick = "";
       btn.innerHTML = "Reset";
       clearInterval(t);

       for (col1=1; col1< tab1.rows.length+1; col1++) {
         if (-1*pos1 >= nRowHeight*col1 && -1*pos1 <= nRowHeight*(col1+1)) { 
            pos1 = -1 * (nRowHeight+2) * (col1);
	    break;
         };
       };
       tab1.style.marginTop = pos1+"px";
       
       for (col2=1; col2< tab2.rows.length+1; col2++) {
         if (-1*pos2 >= nRowHeight*col2 && -1*pos2 <= nRowHeight*(col2+1)) { 
            pos2 = -1 * (nRowHeight+2) * (col2);
	    break;
         };
       };
       tab2.style.marginTop = pos2+"px";

       tab3.style.marginTop = -1* (nRowHeight+2) * (col2+(7*(col1-1)) ) +"px";     //-- виставити в третій колонці потрібне значення

       let memberResult = arrResults.find( arrResults => arrResults.col1 === col1   && arrResults.col2 === col2);
       result.innerHTML = memberResult.result; 

   }; //-- if btn = "Stop"

   if (btn.innerHTML == "Reset" && isClick == "yes") {
       isClick = "";
       btn.innerHTML = "Start";
       result.innerHTML = stResult;
       pos1 = 0;
       pos2 = 0;
       pos3 = 0;
       tab1.style.marginTop = "0px";
       tab2.style.marginTop = "0px";
       tab3.style.marginTop = "0px";
   };

};  //-- btnOnClick



